app/controllers/champions_controller.rb

SELECT `champions`.* FROM `champions`
---
  def index
    @champions = Champion.all

SELECT `champions`.* FROM `champions` WHERE `champions`.`id` = 0 LIMIT 1
---
  def show
    @champion = Champion.find(params[:id])

SELECT `champions`.* FROM `champions` WHERE `champions`.`id` = 1 LIMIT 1
---
  def edit
    @champion = Champion.find(params[:id])

INSERT INTO `champions` (`created_at`, `guide_url`, `image_url`, `name`, `updated_at`) VALUES ('2012-05-07 01:11:39', 'asd', 'asd', 'Akali', '2012-05-07 01:11:39')
---
  def create
    @champion = Champion.new(params[:champion])

    respond_to do |format|
      if @champion.save

SELECT `champions`.* FROM `champions` WHERE `champions`.`id` = 1 LIMIT 1
UPDATE `champions` SET `updated_at` = '2012-05-07 02:21:41', `guide_url` = 'http://solomid.net/guides.php?g=12667', `image_url` = 'http://www.crushfragdestroy.com/wp-content/uploads/Ahri_splash.jpg' WHERE `champions`.`id` = 2
---
  def update
    @champion = Champion.find(params[:id])

    respond_to do |format|
      if @champion.update_attributes(params[:champion])